Revit 2024 API
BRepBuilder.FinishLoop Method
 Indicates that the caller has finished defining the given loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void FinishLoop(
	BRepBuilderGeometryId loopId
)
Visual Basic
Public Sub FinishLoop ( _
	loopId As BRepBuilderGeometryId _
)
Visual C++
public:
void FinishLoop(
	BRepBuilderGeometryId^ loopId
)
Parameters
loopId
Type: Autodesk.Revit.DB.BRepBuilderGeometryId
 Id of the loop.
Remarks
 No functions that modify the given loop's definition should be called after calling this function (e.g., AddCoEdge(BRepBuilderGeometryId, BRepBuilderGeometryId, Boolean)). The BRepBuilder may take the opportunity to validate some of the loop's data and report any problems it finds.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The supplied loop id doesn't correspond to a loop stored in this BRepBuilder object. -or- FinishLoop() has already been called on loopId. -or- The edge loop has fewer than two co-edges.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace